Repository: pop-os/shop
Catalog: po/extra/mo.po
Languages: mo

source: AppCenter
mo: Centru aplicații

source: Browse and manage apps
mo: Căutați și gestionați aplicații

source: install;uninstall;remove;catalogue;store;apps;updates;software;
mo: instala, dezinstala, elimina, catalogul, magazin; aplicații, actualizări, software-ul;

source: About AppCenter
mo: Despre centru de aplicații

source: An app store for indie and open source developers. Browse by categories or search and discover new apps. AppCenter is also used for updating your system to the latest and greatest version for new features and fixes.
mo: Un magazin de aplicații pentru dezvoltatori. Navigați după categorii sau căutați și descoperiți aplicații noi. AppCenter este, de asemenea, utilizat pentru actualizarea sistemului la cea mai recentă și cea mai bună versiune pentru noile caracteristici și remedii.

source: Bug fixes and improve perfomance.
mo: Remedierea erorilor și îmbunătățirea performanțelor.

source: Various bug fixes and performance improvements
mo: Diferite remedierii de erori și îmbunătățiri ale performanței

source: New translations
mo: Nouă traducere

source: Fix crash caused by entries with missing packages
mo: Remedierea accidentului cauzată de intrări de pachete care lipsesc

source: Add capability to search by category and apply minor bug fixes.
mo: Adăugați capacitatea de a căuta după categorie și de a aplica remedierile minore ale erorilor.

source: It is now possible to search apps inside a category
mo: Acum este posibil să căutați aplicații în interiorul unei categorii

source: Prevent multiple authentication dialogs when resuming from suspend
mo: Împiedicați dialogurile multiple de autentificare când reluați din suspendare

source: Search perfomance has beeen improved, the category name is now shown on the headbar and minor bugs have been fixed.
mo: Performanța căutării a fost îmbunătățită, numele categoriei este afișat acum pe bara de cap și au fost rezolvate erorile minore.

source: Fix Steam installation
mo: Fixați instalarea streamului

source: Make search asynchronous
mo: Faceți căutarea asincronă
